/**
 *
 * 编写一个函数sort，实现用 "气泡法" 对输入的10个整数按由小到大顺序排列
 */
#include <stdio.h>

/**
 * 自定义一个函数，用于冒泡排序
 *
 * 比较相邻的元素。如果第一个比第二个大，就交换他们两个。
 * 对每一对相邻元素作同样的工作，从开始第一对到结尾的最后一对。这步做完后，最后的元素会是最大的数。
 * 针对所有的元素重复以上的步骤，除了最后一个。
 * 持续每次对越来越少的元素重复上面的步骤，直到没有任何一对数字需要比较。
 * 13,2,1,44,15,6,17,80,11,25,4
 *
 * -- i=0
 * 2,13,1,44,15,6,17,80,11,25,4 j=0
 * 2,1,13,44,15,6,17,80,11,25,4 j=1
 * 2,1,13,44,15,6,17,80,11,25,4
 * 2,1,13,15,44,6,17,80,11,25,4
 * 2,1,13,15,6,44,17,80,11,25,4
 * 2,1,13,15,6,17,44,80,11,25,4
 * 2,1,13,15,6,17,44,80,11,25,4
 * 2,1,13,15,6,17,44,11,80,25,4
 * 2,1,13,15,6,17,44,11,25,80,4
 * 2,1,13,15,6,17,44,11,25,4,80  i= 0,j= 9 = 10- i-1
 * --i=1
 * 2,1,13,15,6,17,44,11,25,4,80 j=0
 * 1,2,13,15,6,17,44,11,25,4,80
 * 1,2,13,15,6,17,44,11,25,4,80
 * 1,2,13,6,15,17,44,11,25,4,80
 * 1,2,13,6,15,17,44,11,25,4,80
 * 1,2,13,6,15,17,44,11,25,4,80
 * 1,2,13,6,15,17,11,44,25,4,80
 * 1,2,13,6,15,17,11,25,44,4,80
 * 1,2,13,6,15,17,11,25,4,44,80 i=1,j=8=10-i-1
 *
 */
void bubble_sort(int array[], int len)
{
    // i代表循环的次数
    for (int i = 0; i < len - 1; i++)
    {
        for (int j = 0; j < len - i - 1; j++)
        {
            // 比较相邻的元素。如果第一个比第二个大，就交换他们两个。
            if (array[j] > array[j + 1])
            {
                int temp = array[j];
                array[j] = array[j + 1];
                array[j + 1] = temp;
            }
        }
    }
}

int main(int argc, char const *argv[])
{
    int array[] = {13, 2, 1, 44, 15, 6, 17, 80, 11, 25, 4};
    // 获取数组长度
    int len = sizeof(array) / sizeof(array[0]);
    bubble_sort(array, len);
    for (int i = 0; i < len; i++)
    {
        printf("%d ", array[i]);
    }
    return 0;
}
